In [43]:
import pandas as pd
from sklearn.preprocessing import LabelEncoder

In [38]:
df_math=pd.read_csv('MathScoreTerm1.csv')
print(df_math.head())

df_math.drop(['Name','Ethinicity'], axis=1, inplace=True)

#Filling NaN values with Zero
df_math.Score=df_math.Score.fillna(0)

#Filling NaN values with Avarage
#df_math.Score=df_math.Score.fillna(df_math.Score.mean)

df_math.isnull().any()

             Name  Score  Age         Ethinicity Subject Sex  ID
0  AI-KYUNG CHUNG   88.0   18     White American   Maths   M   1
1     ALAN HARVEY   85.0   19  European American   Maths   M   2
2    ALAN REYNAUD   45.0   19  European American   Maths   M   3
3  ALBERT CENDANA   82.0   18     White American   Maths   M   4
4  ALBERT HOLT JR   82.0   18     White American   Maths   F   5

Score      False
Age        False
Subject    False
Sex        False
ID         False
dtype: bool

In [39]:
df_ds = pd.read_csv('DSScoreTerm1.csv')

df_ds.drop(['Name','Ethinicity'], axis=1, inplace=True)

#Filling NaN values with Zero
df_ds.Score=df_ds.Score.fillna(0)

#Filling NaN values with Avarage
#df_ds.Score=df_ds.Score.fillna(df_ds.Score.mean)

df_ds.isnull().any()

Score      False
Age        False
Subject    False
Sex        False
ID         False
dtype: bool

In [40]:
df_phy = pd.read_csv('PhysicsScoreTerm1.csv')

df_phy.drop(['Name','Ethinicity'], axis=1, inplace=True)

#Filling NaN values with Zero
df_phy.Score=df_phy.Score.fillna(0)

#Filling NaN values with Avarage
#df_phy.Score=df_phy.Score.fillna(df_phy.Score.mean)

df_phy.isnull().any()

Score      False
Age        False
Subject    False
Sex        False
ID         False
dtype: bool

In [41]:
df_final = df_ds.append(df_math).append(df_phy)
df_final.shape

(1797, 5)

In [44]:
df_final["Sex"] = [1 if sex == "M" else 2 for sex in df_final["Sex"]]

In [45]:
df_final

     Score  Age        Subject  Sex   ID
0     82.0   18  Data Structue    1    1
1     79.0   19  Data Structue    1    2
2     39.0   19  Data Structue    1    3
3     76.0   18  Data Structue    1    4
4     76.0   18  Data Structue    2    5
..     ...  ...            ...  ...  ...
594   41.0   19        Physics    2  595
595   71.0   18        Physics    1  596
596   49.0   20        Physics    1  597
597   71.0   20        Physics    1  598
598   69.0   19        Physics    1  599

[1797 rows x 5 columns]

In [47]:
df_final.to_csv('ScoreFinal.csv',index=False)